Tekla.Structures.Model.RebarMesh.RebarMeshSpacingMethodEnum
The ways to distribute the reinforcing bars with different spacings.

Tekla.Structures.Model.RebarMesh.RebarMeshSpacingMethodEnum.SPACING_TYPE_UNDEFINED
The undefined spacing type.

Tekla.Structures.Model.RebarMesh.RebarMeshSpacingMethodEnum.SPACING_TYPE_SAME_DISTANCE
Distributes the bars using the same distance for all bars.

Tekla.Structures.Model.RebarMesh.RebarMeshSpacingMethodEnum.SPACING_TYPE_MULTIPLE_VARYING_DISTANCES
Varying distribution of the bars.